In [3]:
import pandas as pd

In [4]:
l = [x for x in range (5)]

In [5]:
s = pd.Series(l)

In [6]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
s[3]

3

In [8]:
s = pd.Series(l,index=['a','b','c','d','e']) #atribuir nome as series

In [9]:
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [10]:
s['e']

4

In [11]:
s = pd.Series(l,index=['a','b','c','d','d']) #É possivel atribuir mesmo nome em series

In [12]:
s['d']

d    3
d    4
dtype: int64

In [13]:
data = {'a':1,'b':2,'c':3,'d':4} #Já cria a série com o index

In [14]:
s = pd.Series(data)

In [15]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
s = pd.Series(data,index=['a','b']) #Alterando os indices, mantendo somente 'a' e 'b'

In [17]:
s

a    1
b    2
dtype: int64

In [18]:
s = pd.Series(data,index=['a','b','c','f']) #Adicionando um valor inexistente 'f'

In [19]:
s

a    1.0
b    2.0
c    3.0
f    NaN
dtype: float64

Querying a Series

In [20]:
serie_1 = pd.Series([x for x in range(1,11)])

In [21]:
serie_1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [22]:
serie_1.iloc[0] #query elementos .iloc

1

In [23]:
serie_1[5:9] #slicing uma serie

5    6
6    7
7    8
8    9
dtype: int64

In [24]:
serie_1.where(serie_1%2==0) #criando condição, aparecer todos os valores %2 = 0

0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [25]:
serie_1.where(serie_1%2==0,'Odd') #adicionando condição caso seja falso

0    Odd
1      2
2    Odd
3      4
4    Odd
5      6
6    Odd
7      8
8    Odd
9     10
dtype: object

In [26]:
serie_1.where(serie_1%2==0,inplace=True) #Mantendo somente os valores reais

In [27]:
serie_1.dropna() #Manter somente o que tiver valor

1     2.0
3     4.0
5     6.0
7     8.0
9    10.0
dtype: float64

In [28]:
serie_1.fillna('Colocando valor')

0    Colocando valor
1                2.0
2    Colocando valor
3                4.0
4    Colocando valor
5                6.0
6    Colocando valor
7                8.0
8    Colocando valor
9               10.0
dtype: object

Pandas_Dataframe

In [29]:
df = pd.DataFrame()

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df = pd.read_csv('train.csv') #chama o arquivo para leitura

In [32]:
df.head() #chama os 5 primeiros conteudo

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
df.tail() #chama os 5 ultimos conteudo, se add numero chama a exata linha

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q